using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace TestApp.BLCore
{
    public class UserRepository
    {
        public void GetUser(User user)
        {
           /* Тестовое задание.
            Разработать ASP.Net MVC приложение с несколькими страницами:
            1.Общая страница - меню для перехода на остальные страницы.На все других страницах должна быть возможность вернуться на эту страницу.
            
            2.Страница выбора текущего пользователя.На странице располагается дропдаун со списком пользователей и кнопка выбрать.
            При нажатии на кнопку "Выбрать" выбранный пользователь должен использоваться далее на остальных страницах. На странице-меню должно отображаться имя выбранного пользователя.
            Список пользователей нужно хранить локально, без использования сервера баз данных.Список пользователей нужно заполнить самостоятельно.
            
            3.Страница отправки сообщения. На странице должны быть расположены textbox для сообщения и кнопка. По нажатию на кнопку происходит отправка и запоминание сообщения на сервере
            (сообщения должны хранится локально, без использования сервера баз данных).
            
            4.Страница просмотра сообщений. На странице должен быть дропдаун и кнопка, позволяющие выбрать пользователя, сообщения которого будут отображаться,
            либо сообщения от всех пользователей сразу.Сообщения выводятся в виде таблицы.В таблице должна быть реализована возможность сортировки по ID или по времени отправки сообщения.
            Колонки в таблице: ID сообщения, имя пользователя, сообщение, время отправления. */
        }
    }
}
